metadata-api-upsertMetadata.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:met="http://soap.sforce.com/2006/04/metadata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <met:SessionHeader>
            <met:sessionId>{{SessionId}}</met:sessionId>
        </met:SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <met:upsertMetadata>
            <metadata xsi:type="met:CustomObject">
                <fullName>Invoice__c</fullName>
                <label>Invoice Header</label>
                <pluralLabel>Invoice Headers</pluralLabel>
                <sharingModel>Read</sharingModel>
                <description>This object stores the Invoice Header details.</description>
                <deploymentStatus>Deployed</deploymentStatus>
                <nameField>
                    <label>ID</label>
                    <type>AutoNumber</type>
                </nameField>
            </metadata>
            <metadata xsi:type="met:CustomObject">
                <fullName>Invoice_Detail__c</fullName>
                <label>Invoice Detail</label>
                <pluralLabel>Invoice Details</pluralLabel>
                <sharingModel>Read</sharingModel>
                <description>This object stores the Invoice Line Details</description>
                <deploymentStatus>Deployed</deploymentStatus>
                <nameField>
                    <label>ID</label>
                    <type>AutoNumber</type>
                </nameField>
            </metadata>
        </met:upsertMetadata>
    </soapenv:Body>
</soapenv:Envelope>
